<?php
// ВСЕГДА разделяйте бизнес-логику и логику-представление !
// Инструкция:
// 1.Сверстайте шаблон вашей страницы (обычный HTML)
// 2.Определите, какие данные вы будуту ей передавать.
// 3.Подготовьте данные, получив их от ваших моделей.
// 4.Передайте (в простейшем случае просто include).
// 5.В шаблоне реализуйте ЛОГИКУ ПРЕДСТАВЛЕНИЯ, т.е. то, как будут отображаться Ваши данные.
// 6.И,наконец, создайте специальный объект, который будет управлять представлением:
// --Хранить в себе данные для него;
// --Отображать заданный шаблон с этими данными.
