<html>
<head>
    <title>Модели данных.ORM.</title>
</head>
<body>
<?php
//ORM (Object Relational Mapping)
//принцип отображения объектов реального мира (и их связей) на объекты вашей программы.
//Т.е. КАЖДОМУ объекту в реальности (пользователь, корзина, заказ, товар и т.п.) должен соответсвовать ОБЪЕКТ в программе.
//ООП прекрасно подходит для реализации этого шаблона проектирования.
//--Класс-описывает какие объекты данных у нас могут быть.
//--Сами данные представлены объектами заданных классов.
//--И мы сразу можем определить "поведение данных" в виде методов этих объектов.
/**
class GuestRecords
{
public function __construct($msg)
{...}
public function getText()
{...}
}
 */
//Методы возвращающие данные, должны возвращать массивы объектов нужного класса.
//Методы принимающие данные, должны принимать объекты нужного класса.

?>
</body>
</html>